constant/dynamicMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      motionProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dynamicFvMesh   dynamicMotionSolverFvMesh;

motionSolverLibs   ("librigidBodyMeshMotion.so");

motionSolver       rigidBodyMotion;

rigidBodyMotionCoeffs
{
    report          on;

    solver
    {
        type    Newmark;
    }

    accelerationRelaxation 1;
    accelerationDamping 1;

    bodies
    {
        floatingObject
        {
            type            cuboid;
            parent          root;

            // Cuboid dimensions
            Lx              0.059;
            Ly              0.059;
            Lz              0.243;

            // Cuboid mass
            mass            0.621; //#calc "$rho*$Lx*$Ly*$Lz*M_PI_4";
            L               ($Lx $Ly $Lz); //unnecessary as we do not allow any rotations
            centreOfMass    (0 0 0);
            transform       (1 0 0 0 1 0 0 0 1) (0 0 0);

            joint
            {
                type            Pz;
            }

            patches         (floatingObject);
            innerDistance   0.05;
            outerDistance   0.1;
        }
    }
}


// ************************************************************************* //
